tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1937_tdd.h
#define SSPM2                         522
#define SSPM3                         523
#define CKP                           524
#define SSPEN                         525
#define SSPOV                         526
#define WCOL                          527
#define SSPCON2                       528
#define SEN                           529
#define RSEN                          530
#define PEN                           531
#define RCEN                          532
#define ACKEN                         533
#define ACKDT                         534
#define ACKSTAT                       535
#define GCEN                          536
#define SSPCON3                       537
#define DHEN                          538
#define AHEN                          539
#define SBCDE                         540
#define SDAHT                         541
#define BOEN                          542
#define SCIE                          543
#define PCIE                          544
#define ACKTIM                        545
#define CCPR1L                        546
#define CCPR1H                        547
#define CCP1CON                       548
#define CCP1M0                        549
#define CCP1M                         550
#define CCP1M1                        551
#define CCP1M2                        552
#define CCP1M3                        553
#define DC1B                          554
#define DC1B0                         555
#define DC1B1                         556
#define P1M                           557
#define P1M0                          558
#define P1M1                          559
#define PWM1CON                       560
#define P1DC0                         561
#define P1DC1                         562
#define P1DC2                         563
#define P1DC3                         564
#define P1DC4                         565
#define P1DC5                         566
#define P1DC6                         567
#define P1RSEN                        568
#define CCP1AS                        569
#define PSS1BD0                       570
#define PSS1BD1                       571
#define PSS1AC0                       572
#define PSS1AC1                       573
#define CCP1AS0                       574
#define CCP1AS1                       575
#define CCP1AS2                       576
#define CCP1ASE                       577
#define PSTR1CON                      578
#define STR1A                         579
#define STR1B                         580
#define STR1C                         581
#define STR1D                         582
#define STR1SYNC                      583
#define CCPR2L                        584
#define CCPR2H                        585
#define CCP2CON                       586
#define CCP2M                         587
#define CCP2M0                        588
#define CCP2M1                        589
#define CCP2M2                        590
#define CCP2M3                        591
#define DC2B                          592
#define DC2B0                         593
#define DC2B1                         594
#define P2M                           595
#define P2M0                          596
#define P2M1                          597
#define PWM2CON                       598
#define P2DC0                         599
#define P2DC1                         600
#define P2DC2                         601
#define P2DC3                         602
#define P2DC4                         603
#define P2DC5                         604
#define P2DC6                         605
#define P2RSEN                        606
#define CCP2AS                        607
#define PSS2BD0                       608
#define PSS2BD1                       609
#define PSS2AC0                       610
#define PSS2AC1                       611
#define CCP2AS0                       612
#define CCP2AS1                       613
#define CCP2AS2                       614
#define CCP2ASE                       615
#define PSTR2CON                      616
#define STR2A                         617
#define STR2B                         618
#define STR2C                         619
#define STR2D                         620
#define STR2SYNC                      621
#define CCPTMRS0                      622
#define C1TSEL0                       623
#define C1TSEL                        624
#define C1TSEL1                       625
#define C2TSEL0                       626
#define C2TSEL                        627
#define C2TSEL1                       628
#define C3TSEL0                       629
#define C3TSEL                        630
#define C3TSEL1                       631
#define C4TSEL                        632
#define C4TSEL0                       633
#define C4TSEL1                       634
#define CCPTMRS1                      635
#define C5TSEL                        636
#define C5TSEL0                       637
#define C5TSEL1                       638
#define CCPR3L                        639
#define CCPR3H                        640
#define CCP3CON                       641
#define CCP3M                         642
#define CCP3M0                        643
#define CCP3M1                        644
#define CCP3M2                        645
#define CCP3M3                        646
#define DC3B                          647
#define DC3B0                         648
#define DC3B1                         649
#define P3M                           650
#define P3M0                          651
#define P3M1                          652
#define PWM3CON                       653
#define P3DC0                         654
#define P3DC1                         655
#define P3DC2                         656
#define P3DC3                         657
#define P3DC4                         658
#define P3DC5                         659
#define P3DC6                         660
#define P3RSEN                        661
#define CCP3AS                        662
#define PSS3BD0                       663
#define PSS3BD1                       664
#define PSS3AC0                       665
#define PSS3AC1                       666
#define CCP3AS0                       667
#define CCP3AS1                       668
#define CCP3AS2                       669
#define CCP3ASE                       670
#define PSTR3CON                      671
#define STR3A                         672
#define STR3B                         673
#define STR3C                         674
#define STR3D                         675
#define STR3SYNC                      676
#define CCPR4L                        677
#define CCPR4H                        678
#define CCP4CON                       679
#define CCP4M                         680
#define CCP4M0                        681
#define CCP4M1                        682
#define CCP4M2                        683
#define CCP4M3                        684
#define DC4B0                         685
#define DC4B                          686
#define DC4B1                         687
#define CCPR5L                        688
#define CCPR5H                        689
#define CCP5CON                       690
#define CCP5M0                        691
#define CCP5M                         692
#define CCP5M1                        693
#define CCP5M2                        694
#define CCP5M3                        695
#define DC5B0                         696
#define DC5B                          697
#define DC5B1                         698
#define IOCBP                         699
#define IOCBP0                        700
#define IOCBP1                        701
#define IOCBP2                        702
#define IOCBP3                        703
#define IOCBP4                        704
#define IOCBP5                        705
#define IOCBP6                        706
#define IOCBP7                        707
#define IOCBN0                        708
#define IOCBN                         709
#define IOCBN1                        710
#define IOCBN2                        711
#define IOCBN3                        712
#define IOCBN4                        713
#define IOCBN5                        714
#define IOCBN6                        715
#define IOCBN7                        716
#define IOCBF0                        717
#define IOCBF                         718
#define IOCBF1                        719
#define IOCBF2                        720
#define IOCBF3                        721
#define IOCBF4                        722
#define IOCBF5                        723
#define IOCBF6                        724
#define IOCBF7                        725
#define TMR4                          726
#define PR4                           727
#define T4CON                         728
#define T4CKPS0                       729
#define T4CKPS                        730
#define T4CKPS1                       731
#define TMR4ON                        732
#define T4OUTPS                       733
#define T4OUTPS0                      734
#define T4OUTPS1                      735
#define T4OUTPS2                      736
#define T4OUTPS3                      737
#define TMR6                          738
#define PR6                           739
#define T6CON                         740
#define T6CKPS0                       741
#define T6CKPS                        742
#define T6CKPS1                       743
#define TMR6ON                        744
#define T6OUTPS0                      745
#define T6OUTPS                       746
#define T6OUTPS1                      747
#define T6OUTPS2                      748
#define T6OUTPS3                      749
#define LCDCON                        750
#define LMUX0                         751
#define LMUX                          752
#define LMUX1                         753
#define CS                            754
#define CS0                           755
#define CS1                           756
#define WERR                          757
#define SLPEN                         758
#define LCDEN                         759
#define LCDPS                         760
#define LP                            761
#define LP0                           762
#define LP1                           763
#define LP2                           764
#define LP3                           765
#define WA                            766
#define LCDA                          767
#define BIASMD                        768
#define WFT                           769
#define LCDREF                        770
#define VLCD1PE                       771
#define VLCD2PE                       772
#define VLCD3PE                       773
#define LCDIRI                        774
#define LCDIRS                        775
#define LCDIRE                        776
#define LCDCST0                       777
#define LCDCST                        778
#define LCDCST1                       779
#define LCDCST2                       780
#define LCDRL                         781
#define LRLAT0                        782
#define LRLAT                         783
#define LRLAT1                        784
#define LRLAT2                        785
#define LRLBP                         786
#define LRLBP0                        787
#define LRLBP1                        788
#define LRLAP0                        789
#define LRLAP                         790
#define LRLAP1                        791
#define LCDSE0                        792
#define SE0                           793
#define SE1                           794
#define SE2                           795
#define SE3                           796
#define SE4                           797
#define SE5                           798
#define SE6                           799
#define SE7                           800
#define LCDSE1                        801
#define SE8                           802
#define SE9                           803
#define SE10                          804
#define SE11                          805
#define SE12                          806
#define SE13                          807
#define SE14                          808
#define SE15                          809
#define LCDSE2                        810
#define SE16                          811
#define SE17                          812
#define SE18                          813
#define SE19                          814
#define SE20                          815
#define SE21                          816
#define SE22                          817
#define SE23                          818
#define LCDDATA0                      819
#define SEG0COM0                      820
#define SEG1COM0                      821
#define SEG2COM0                      822
#define SEG3COM0                      823
#define SEG4COM0                      824
#define SEG5COM0                      825
#define SEG6COM0                      826
#define SEG7COM0                      827
#define LCDDATA1                      828
#define SEG8COM0                      829
#define SEG9COM0                      830
#define SEG10COM0                     831
#define SEG11COM0                     832
#define SEG12COM0                     833
#define SEG13COM0                     834
#define SEG14COM0                     835
#define SEG15COM0                     836
#define LCDDATA2                      837
#define SEG16COM0                     838
#define SEG17COM0                     839
#define SEG18COM0                     840
#define SEG19COM0                     841
#define SEG20COM0                     842
#define SEG21COM0                     843
#define SEG22COM0                     844
#define SEG23COM0                     845
#define LCDDATA3                      846
#define SEG0COM1                      847
#define SEG1COM1                      848
#define SEG2COM1                      849
#define SEG3COM1                      850
#define SEG4COM1                      851
#define SEG5COM1                      852
#define SEG6COM1                      853
#define SEG7COM1                      854
#define LCDDATA4                      855
#define SEG8COM1                      856
#define SEG9COM1                      857
#define SEG10COM1                     858
#define SEG11COM1                     859
#define SEG12COM1                     860
#define SEG13COM1                     861
#define SEG14COM1                     862
#define SEG15COM1                     863
#define LCDDATA5                      864
#define SEG16COM1                     865
#define SEG17COM1                     866
#define SEG18COM1                     867
#define SEG19COM1                     868
#define SEG20COM1                     869
#define SEG21COM1                     870
#define SEG22COM1                     871
#define SEG23COM1                     872
#define LCDDATA6                      873
#define SEG0COM2                      874
#define SEG1COM2                      875
#define SEG2COM2                      876
#define SEG3COM2                      877
#define SEG4COM2                      878
#define SEG5COM2                      879
#define SEG6COM2                      880
#define SEG7COM2                      881
#define LCDDATA7                      882
#define SEG8COM2                      883
#define SEG9COM2                      884
#define SEG10COM2                     885
#define SEG11COM2                     886
#define SEG12COM2                     887
#define SEG13COM2                     888
#define SEG14COM2                     889
#define SEG15COM2                     890
#define LCDDATA8                      891
#define SEG16COM2                     892
#define SEG17COM2                     893
#define SEG18COM2                     894
#define SEG19COM2                     895
#define SEG20COM2                     896
#define SEG21COM2                     897
#define SEG22COM2                     898
#define SEG23COM2                     899
#define LCDDATA9                      900
#define SEG0COM3                      901
#define SEG1COM3                      902
#define SEG2COM3                      903
#define SEG3COM3                      904
#define SEG4COM3                      905
#define SEG5COM3                      906
#define SEG6COM3                      907
#define SEG7COM3                      908
#define LCDDATA10                     909
#define SEG8COM3                      910
#define SEG9COM3                      911
#define SEG10COM3                     912
#define SEG11COM3                     913
#define SEG12COM3                     914
#define SEG13COM3                     915
#define SEG14COM3                     916
#define SEG15COM3                     917
#define LCDDATA11                     918
#define SEG16COM3                     919
#define SEG17COM3                     920
#define SEG18COM3                     921
#define SEG19COM3                     922
#define SEG20COM3                     923
#define SEG21COM3                     924
#define SEG22COM3                     925
#define SEG23COM3                     926
#define STATUS_SHAD                   927
#define C_SHAD                        928
#define DC_SHAD                       929
#define Z_SHAD                        930
#define WREG_SHAD                     931
#define BSR_SHAD                      932
#define PCLATH_SHAD                   933
#define FSR0L_SHAD                    934
#define FSR0H_SHAD                    935
#define FSR1L_SHAD                    936
#define FSR1H_SHAD                    937
#define STKPTR                        938
#define TOSL                          939
#define TOSH                          940

#endif // _PIC16LF1937_H_
